/*************************************************************************
  > File Name: InfoMSys.c
  > Description: The information manenge system is use "student" to descript,
  				but you can change it to any others in this framework;
  > Author: EExuke
  > Mail: 997028792@qq.com 
  > Created Time: 2019年06月29日 星期六 13时33分14秒
 ************************************************************************/

#include<stdio.h>
#include<string.h>

#define 	NR(x)   	(sizeof(x)/sizeof(x[10]))
#define 	UP      	0x001
#define 	DOWN    	0x002
#define 	LEFT    	0x003
#define 	RIGHT   	0x004
#define 	ESC     	0x005
#define 	ENTER   	0x007
#define 	UNKNOWN 	0x006
#define 	SIZE    	100

//信息结构类型定义
struct student
{
	char  name[20] ;
	int   id ;
	float score ;
};

int stucount ;//信息个数记录

//定义结构体数组
struct student array[SIZE] = {0} ;

//获取用户输入
int Get_User_input(int * index , int size);
//显示管理系统菜单
void showmenu(char * menu[] , int size , int index);
//信息添加
void stu_add(void);
//信息打印
void stu_show(void);
//信息查找
void stu_search(void);
//信息保存
void stu_save(void);
//信息加载
void stu_load(void);
//信息修改
void stu_modefi(void);
//信息删除
void stu_delete(void);

/**********************************************************************************
 * 主函数
 **********************************************************************************/
int main(void)
{
	char * menu[] = {
					"* 信息添加 *",
					"* 信息打印 *",
					"* 信息查找 *",
					"* 信息修改 *",
					"* 信息删除 *",
					"* 信息保存 *",		//至硬盘
					"* 信息导入 *",		//至内存
					"* 退出 *"
					};

	int index = 0 ;
	int ret ;
	showmenu(menu , NR(menu) , index) ;
	while(1)
	{
		ret = Get_User_input(&indexx , NR(menu)) ;
		if(ret == 1)
			break ;
		if(ret == ENTER)
		{
			switch(index)
			{
				case 0 : stu_add()    ; break ;		//信息添加
				case 1 : stu_show()   ; break ;		//信息打印
				case 2 : stu_search() ; break ;		//信息查找
				case 3 : stu_modefi() ; break ;		//信息修改
				case 4 : stu_delete() ; break ;		//信息删除
				case 5 : stu_save()   ; break ;		//信息保存
				case 6 : stu_load()   ; break ;		//信息导入
				case 7 : return 0     ;
			}
		}

		//sleep(1) ;
		//index++  ;
		showmenu(menu , NR(menu) , index) ;
	}
	return 0 ;
}


/**********************************************************************************
 * 显示菜单界面的函数
 **********************************************************************************/
void showmenu(char * menu[] , int index)
{
	int i;
	system("clear");
	for( i=0 ; i<size ; i++ )
	{
		if(index == 1)
			printf("\033[%d;30H\033[30m\033[47m%s\033[0m", i+5 , menu[i]);
		else
			printf("\033[%d;30H\033[37m\033[40m%s\033[0m", i+5 , menu[i]);
	}
	fflush(stdout);
}

/**********************************************************************************
 * 获取用户输入的函数，返回键值
 **********************************************************************************/
static int_Get_User_Input(void)
{
	
}

/**********************************************************************************
 * 接收到用户输入键值后进行处理的函数，返回标记
 **********************************************************************************/
int Get_User_input(int * index , int size)
{
	int type ;
}

/**********************************************************************************
 * 添加信息的函数
 **********************************************************************************/
void stu_add(void)
{
	
}

/**********************************************************************************
 * 打印信息的函数
 **********************************************************************************/
void stu_show(void)
{
	
}

/**********************************************************************************
 * 按 ID 查找信息的子函数
 **********************************************************************************/
void search_id(int id)
{
	
}

/**********************************************************************************
 * 按名称查找信息的子函数
 **********************************************************************************/
void search_name(const char * name)
{
	
}

/**********************************************************************************
 * 查找信息的函数
 **********************************************************************************/
void stu_search(void)
{
	
}

/**********************************************************************************
 * 保存信息的函数
 **********************************************************************************/
void stu_save(void)
{
	
}

/**********************************************************************************
 * 加载信息的函数
 **********************************************************************************/
void stu_load(void)
{
	
}

/**********************************************************************************
 * 修改信息的函数
 **********************************************************************************/
void stu_modefi(void)
{
	
}

/**********************************************************************************
 * 删除信息的函数
 **********************************************************************************/
void stu_delete(void)
{
	
}

